app/controllers/articles_controller.rb

  def create
    logger.debug("create!!")

    @article = Article.new(article_params)
    logger.debug(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["text", ""], ["created_at", "2017-11-01 09:20:19.444405"], ["updated_at", "2017-11-01 09:20:19.444405"]]

  def edit
    logger.debug("Hello, world!")
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    logger.debug("update!!")
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "aaaaaa"], ["text", "aaaaaa"], ["updated_at", "2017-11-06 11:32:45.146017"], ["id", 3]]